app/mailers/order_mailer.rb

	def customer_confirmation(order)
		#sends an email to the customer to confirm their reservation
		@booking = Booking.find(order.booking_id)
		@user = User.find(@booking.user_id)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]