app/controllers/admin/hostels_controller.rb

  def index
    @hostels = Hostel.all
---
SELECT "hostels".* FROM "hostels"