app/views/admin/admins/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
      <div class="row my-2 mx-auto border " style="align-items:center; background-color:white; border-radius:4px; width:98%;">
        <p class="col-12" style="font-size:14px;"><%= booking.user.first_name %> <%= booking.user.last_name %>