app/controllers/bookings_controller.rb

  def show
  	@booking = Booking.find(params[:id])
  	if @booking.option_id != nil
  		@option = Option.find(@booking.option_id)
  	end
  	if @booking.hostel_id != nil
  		@hostel = Hostel.find(@booking.hostel_id)
---
SELECT  "hostels".* FROM "hostels" WHERE "hostels"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]