app/controllers/bookings_controller.rb

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def new
    @hostels = Hostel.all
  	@booking = Booking.new
  	if params[:hostels_id] != nil
  		@hostel = Hostel.find(params[:hostels_id])

INSERT INTO "bookings" ("full_board", "start_date", "end_date", "created_at", "updated_at", "user_id", "hostel_id", "location_item") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	price_lesson = 140.0

  	checkbox_fullboard = state_checkbox(params[:full_board])
  	checkbox_location_item = state_checkbox(params[:location_item])

    if checkbox_location_item
      number_location = params[:number]
      start_date_location = params[:start_date_location]
      end_date_location = params[:end_date_location]
    end

  	if params[:start_date_option] != "" and params[:end_date_option] != ""
  		option = Option.create(start_date: params[:start_date_option], end_date: params[:end_date_option], price: price_lesson)
  		booking = Booking.create(start_date: params[:start_date], end_date: params[:end_date],user_id: current_user.id, hostel_id: params[:hostel], option_id: option.id, full_board: checkbox_fullboard, location_item: checkbox_location_item, bed_booked: params[:bed_booked], number_location: number_location, start_date_location_item: start_date_location, end_date_location_item: end_date_location)

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def nil_hostel(hostel)
  	if hostel != nil
  		return Hostel.find(hostel)