app/controllers/hostels_controller.rb

SELECT "hostels".* FROM "hostels"
---
  def index
    @hostels = Hostel.all

SELECT  "hostels".* FROM "hostels" WHERE "hostels"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def show
    @hostel = Hostel.find(params[:id])