app/controllers/users_controller.rb

  def show

    @user = User.find(params[:id])
    @booking = Booking.where(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 32]]